-- =============================================
-- 启动页: dashboard-nvim
-- =============================================
return {
  "nvimdev/dashboard-nvim",
  cond = not vim.g.vscode,
  event = "VimEnter",
  dependencies = { "nvim-tree/nvim-web-devicons" },
  opts = {
    theme = "doom",
    config = {
      header = {
        "",
        "",
        "",
        " ███╗   ██╗ ███████╗ ██████╗  ██╗   ██╗ ██╗ ███╗   ███╗ ",
        " ████╗  ██║ ██╔════╝██╔═══██╗ ██║   ██║ ██║ ████╗ ████║ ",
        " ██╔██╗ ██║ █████╗  ██║   ██║ ██║   ██║ ██║ ██╔████╔██║ ",
        " ██║╚██╗██║ ██╔══╝  ██║   ██║ ╚██╗ ██╔╝ ██║ ██║╚██╔╝██║ ",
        " ██║ ╚████║ ███████╗╚██████╔╝  ╚████╔╝  ██║ ██║ ╚═╝ ██║ ",
        " ╚═╝  ╚═══╝ ╚══════╝ ╚═════╝    ╚═══╝   ╚═╝ ╚═╝     ╚═╝ ",
        "",
        "",
      },
      center = {
        { icon = "  ", desc = "Find File", key = "f", action = "FzfLua files" },
        { icon = "  ", desc = "Recent Files", key = "r", action = "FzfLua oldfiles" },
        { icon = "  ", desc = "Grep Text", key = "g", action = "FzfLua live_grep" },
        { icon = "  ", desc = "File Browser", key = "e", action = "Yazi" },
        { icon = "  ", desc = "Config", key = "c", action = "FzfLua files cwd=~/.config/nvim" },
        { icon = "󰒲  ", desc = "Lazy", key = "l", action = "Lazy" },
        { icon = "  ", desc = "Quit", key = "q", action = "qa" },
      },
      footer = {},
    },
  },
}
